a = '0'
os = [0,0]
while a != 'Выход':
    print("Текущее положение персанажа:" + "(" + str(os)[1:-1] + ")")
    a = input("Введите направление движения персанажа:\nВлево\nВправо\nВверх\nВниз\nВыход\nВаш выбор:")
    if (a != 'Выход'):    
        d = input("Введите количество шагов:")
        x = int(d)
        if ( a == 'Влево'):
            os[0] = os[0] - x
        elif (a == 'Вправо'):
            os[0] = os[0] + x
        elif (a == 'Вверх'):
            os[1] = os[1] + x
        elif (a == 'Вниз'):
            os[1] = os[1] - x
else:
    print("Выход")